---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpacingLayoutn2
source: html/82fadee2-5086-ae2e-3e48-648b1bc9039d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpacingLayoutn2 Property

"Layout"

## Syntax (C#)
```csharp
public static ForgeTypeId SpacingLayoutn2 { get; }
```